using System;
using System.Collections.Generic;

namespace RankGenerator
{
    public class RankGeneratorService : IRankGeneratorService
    {
        string[] rankArray = { "Рядовой (курсант)", "Ефрейтор", "Младший сержант", "Сержант", "Старший сержант", "Старшина",
                               "Прапорщик", "Старший прапорщик", "Младший лейтенант", "Лейтенант","Старший лейтенант", "Капитан", "Майор", "Подполковник", "Полковник", "Генерал-майор", "Генерал-лейтенант", "Генерал-полковник", "Генерал армии", "Маршал Российской Федерации", "Матрос (курсант)", "Старший матрос", "Старшина 2 статьи", "Старшина 1 статьи", "Главный старшина", "Главный корабельный старшина", "Мичман", "Старший мичман", "Младший лейтенант", "Лейтенант", "Старший лейтенант", "Капитан-лейтенант", "Капитан 3 ранга", "Капитан 2 ранга",
                               "Капитан 1 ранга", "Контр-адмирал", "Вице-адмирал", "Адмирал", "Адмирал флота" };
        Random rnd = new Random();

        public string Generate()
        {
            return rankArray[rnd.Next(0, rankArray.Length - 1)];    
        }
    }
}